import itchat
import random
import time
zhufu = [
	"春节拜年早来到，真心祝福新年好。新年招财又进宝，全家和睦无烦恼。狗年更比鸡年好，猴子送福三级跳，一跳更比一跳高，四季平安乐逍遥。祝狗年快乐!",
	"一年有一春，春春在我心，一年有一夏，夏夏你发达，一年有一秋，秋秋你丰收，一年有一冬，冬冬你成功，年年有春节，节节你喜悦!",
	"春节将至，洋洋意气，欢乐绕屋，一团和气;朋友连心，心心相惜，惦记万千，一声祝福。福星高照，财禄寿喜，团团圆圆，吉祥如意。预祝您新年快乐!",
	"除夕夜，春节倒计时，快乐元素在积聚，欢乐军团急行军，迫不急待的我，与新年阳光一道启程，把一年祝福提前给你，祝你红红火火过新年。",
	"狗年吉祥，祝您狗狗精神――心中收藏，狗飞凤舞――快乐飞扬，狗腾狗跃――活力显现，蛟狗得水――事业高升，望子成狗――家庭和睦，飞狗在天――生活美满。新的一年，愿你天天快乐。",
	"转眼到除夕，新春送豪礼。祝福藏心底，真心祝愿你。钱途千万里，爱情甜如蜜。万事皆顺利，合家都如意。祝您全家除夕愉快。",
    "寅羊辞岁千家乐，金狗迎春喜事多。新年团圆合家欢，亲朋好友尽开颜。狗年快乐，一切安康！",
    "吉祥新春送喜来，如意健康添起来，美好生活伴你来，开心快乐随你来，狗年祥瑞奏出来，万事如意奏起来，愿你新年更愉快，幸福新年更开怀。"
]
# 登录
itchat.auto_login()

# 获取好友列表
friendList = itchat.get_friends()

# 打印好友列表和昵称

for user in friendList:
    print("已经发送给,",user['NickName'])
    xiaoxi = "亲爱的"+user['NickName']+","+random.choice(zhufu) + "——————杨凌锋的祝福"
    itchat.send(xiaoxi, toUserName=user['UserName'])
    time.sleep(2)